# 1.Concatinating Dataframes
joining two or more dataframes

In [4]:
import pandas as pd
india_weather = pd.DataFrame({
    "city":["mumbai","delhi","banglore"],
    "temperature":[32,45,30],
    "humidity":[80,40,70]
})
india_weather

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        40
2  banglore           30        70

In [5]:
us_weather = pd.DataFrame({
    "city":["new york","chicago","orlando"],
    "temperature":[27,14,35],
    "humidity":[60,65,70]
})
us_weather

       city  temperature  humidity
0  new york           27        60
1   chicago           14        65
2   orlando           35        70

In [7]:
df = pd.concat([india_weather,us_weather])
df

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        40
2  banglore           30        70
0  new york           27        60
1   chicago           14        65
2   orlando           35        70

##### if we want a continious index

In [8]:
df = pd.concat([india_weather,us_weather], ignore_index=True)
df

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        40
2  banglore           30        70
3  new york           27        60
4   chicago           14        65
5   orlando           35        70

In [9]:
df = pd.concat([india_weather,us_weather], keys=['india','us'])
df

             city  temperature  humidity
india 0    mumbai           32        80
      1     delhi           45        40
      2  banglore           30        70
us    0  new york           27        60
      1   chicago           14        65
      2   orlando           35        70

In [10]:
df.loc["india"]

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        40
2  banglore           30        70

In [11]:
df.loc["us"]

       city  temperature  humidity
0  new york           27        60
1   chicago           14        65
2   orlando           35        70

### appending as columns

In [13]:
temperature_df = pd.DataFrame({
    "city":["new york","chicago","orlando"],
    "temperature":[27,14,35]
})
temperature_df

       city  temperature
0  new york           27
1   chicago           14
2   orlando           35

In [14]:
windspeed_df = pd.DataFrame({
    "city":["new york","chicago","orlando"],
    "windspeed":[7,14,10]
})
windspeed_df

       city  windspeed
0  new york          7
1   chicago         14
2   orlando         10

In [17]:
df = pd.concat([temperature_df,windspeed_df], axis=1) #if axis is 1 it appends them as columns and rows if axis is 0
df

       city  temperature      city  windspeed
0  new york           27  new york          7
1   chicago           14   chicago         14
2   orlando           35   orlando         10

### if the order of cities is different
we use index in pd.DataFrame to solve the problem data disarrangement

In [20]:
temperature_df = pd.DataFrame({
    "city":["new york","chicago","orlando"],
    "temperature":[27,14,35]
}, index=[0,1,2])
windspeed_df = pd.DataFrame({
    "city":["chicago","new york"], #we are missing data from orlando
    "windspeed":[7,14]
}, index=[1,0])

In [21]:
df = pd.concat([temperature_df,windspeed_df], axis=1)
df

       city  temperature      city  windspeed
0  new york           27  new york       14.0
1   chicago           14   chicago        7.0
2   orlando           35       NaN        NaN

### we can also join dataframes to series

In [22]:
#creating a Series data type
s = pd.Series(['humid','dry','rain'], name="event")
s

0    humid
1      dry
2     rain
Name: event, dtype: object

In [23]:
#concatinating with the dataframe
pd.concat([temperature_df, s], axis=1)

       city  temperature  event
0  new york           27  humid
1   chicago           14    dry
2   orlando           35   rain

# 2. Merge Dataframes

In [24]:
df1 = pd.DataFrame({
    "city":["new york","chicago","orlando"],
    "temperature":[27,14,35]
})
df1

       city  temperature
0  new york           27
1   chicago           14
2   orlando           35

In [25]:
df2 = pd.DataFrame({
    "city":["new york","chicago","orlando"],
    "humidity":[65,68,75]
})
df2

       city  humidity
0  new york        65
1   chicago        68
2   orlando        75

In [26]:
df3 = pd.merge(df1,df2,on='city') #merge is same as JOINs in SQL
df3

       city  temperature  humidity
0  new york           27        65
1   chicago           14        68
2   orlando           35        75

###### _a different senerio_

In [28]:
df1 = pd.DataFrame({
    "city":["new york","chicago","orlando","baltimore"],
    "temperature":[27,14,35,32]
})
df2 = pd.DataFrame({
    "city":["new york","chicago","san francisco"],
    "humidity":[65,68,76]
})
#we perfome the join we find that the result has only new york and chicago - intersection(inner join)
df3 = pd.merge(df1,df2,on='city') #merge is same as JOINs in SQL
df3

       city  temperature  humidity
0  new york           27        65
1   chicago           14        68

In [29]:
#union(outer join)
df3 = pd.merge(df1,df2,on='city', how="outer") 
df3

            city  temperature  humidity
0       new york         27.0      65.0
1        chicago         14.0      68.0
2        orlando         35.0       NaN
3      baltimore         32.0       NaN
4  san francisco          NaN      76.0

In [30]:
#left join
df3 = pd.merge(df1,df2,on='city', how="left") 
df3

        city  temperature  humidity
0   new york           27      65.0
1    chicago           14      68.0
2    orlando           35       NaN
3  baltimore           32       NaN

In [31]:
#right join
df3 = pd.merge(df1,df2,on='city', how="right") 
df3

            city  temperature  humidity
0       new york         27.0        65
1        chicago         14.0        68
2  san francisco          NaN        76

In [32]:
df3 = pd.merge(df1,df2,on='city', how="outer", indicator=True) 
df3

            city  temperature  humidity      _merge
0       new york         27.0      65.0        both
1        chicago         14.0      68.0        both
2        orlando         35.0       NaN   left_only
3      baltimore         32.0       NaN   left_only
4  san francisco          NaN      76.0  right_only

###### lets say you have common columns

In [37]:
df1 = pd.DataFrame({
    "city":["new york","chicago","orlando","baltimore"],
    "temperature":[27,14,35,32],
    "humidity":[65,68,76,78]
})
df2 = pd.DataFrame({
    "city":["new york","chicago","san diago"],
    "temperature":[21,12,36],
    "humidity":[60,58,70]
})
df3 = pd.merge(df1,df2,on='city', suffixes=('_left','_right')) 
df3
#we notice it automatically appends _x and _y to column names bcoz they were repeated - we append the suffixes inplace of _x and _y

,city,temperature_left,humidity_left,temperature_right,humidity_right
0,new york,27,65,21,60
1,chicago,14,68,12,58